[
   {
      "name":"Jim DiEugenio",
      "link":"jim-dieugenio",
      "primary":true,
      "thumbnail":"/assets/images/speakers/primary/jim-dieugenio.jpg",
      "bio":"<p>Jim DiEugenio has piloted CTKA (Citizens for Truth in the Kennedy Assassination) and its website since it was organized as a result for the April 1993 Chicago Midwest Symposium on Assassination. Along with articles and reviews, DiEugenio has written two books on the Kennedy assassination. \"Destiny Betrayed\" (1992 and was updated and republished in 2012) was the first positive reconsideration of the Jim Garrison investigation in a generation. \"The Assassinations\" (2003, co-edited with Lisa Pease) analyzed the murders of RFK, MLK and Malcolm X, but devoted most of its pages to the  ARRB (Assassinated Records Review Board) documents in the JFK case. He and Pease also edited the journal \"Probe\" (1993-2000) which focused on the releases of the ARRB and developments in the MLK and RFK cases.</p><p> DiEugenio has an MA in Contemporary American History from California State University Northridge. In 2016, his book \"Reclaiming Parkland'' was published. In it, DiEugenio rebuts the movie (yet to be released at that time) called \"Parkland\" which Tom Hanks was working on based on a portion of Vincent Bugiosi’s book \"Reclaiming History\".  He was asked by director Oliver Stone to do a commentary track on the expanded DVD version of his film \"JFK\". Stone resealty worked on a documentary with Stone called \"Destiny Betrayed\" which is still in the post production stages at this time.</p>"
   },
   {
      "name":"Bill Simpich",
      "link":"bill-simpich",
      "primary":true,
      "thumbnail":"/assets/images/speakers/primary/bill-simpich.jpg",
      "bio":"<p>Bill Simpich is a civil rights attorney and an anti-war activist in the San Francisco Bay Area. The main areas of his law practice are government misconduct and toxic tort violations. He also writes for publications such as Truthout, Counterpunch and OpedNews. He considers the assassination cases to be a poorly understood area of civil rights violations. To preserve cold cases, he is preparing a proposed JFK Preservation of Evidence Act that would be applicable in both of these areas of the law and administered by a citizen panel similar to the ARRB. His study of the JFK case focuses on the documentary evidence, rather than firearms, acoustics, and other forensic evidence. He was awarded the JFK Lancer Mary Ferrell \"New Frontier\" Award, 2011.</p>"
   },
   {
      "name":"Robert Groden",
      "link":"robert-groden",
      "primary":true,
      "thumbnail":"/assets/images/speakers/primary/robert-groden.jpg",
      "bio":"<p>Robert Groden became interested in the assassination of President Kennedy on the day it happened, which was Robert's eighteenth birthday. This Shakespearian coincidence became the genesis which would take over a large portion of his adult life. In February 1975, he gave testimony to the Rockefeller Commission on the assassination. He released the Zapruder film nationally on March 15, 1975 on Goodnight America hosted by Geraldo Rivera. He later was employed as a photographic panelist for the House Select Committee on Assassinations. While on the panel he argued that President Kennedy was assassinated as a result of a conspiracy by using the photographic evidence.<\/p> <p>In the December 31, 1991 edition of the Globe, Groden released color autopsy photographs of President Kennedy that had never been viewed by the public. Groden has accumulated a vast collection of photographic evidence over the years and has appeared in many documentaries on the Kennedy assassination. He has authored and co-authored a pile of books such as JFK: The Case for Conspiracy (1976), Government by Gunplay (1976), High Treason (1989), The Killing of a President (1993), The Search for Lee Harvey Oswald (1995), and JFK: Absolute Proof (2013). He founded New Frontier Productions where he produced, edited and directed documentaries such as The Killing of a President, The Assassination Films, and JFK: The Case for Conspiracy.<\/p><p>Outside of his own films, Robert is no stranger to movies as he has been a consultant for JFK, and provided film footage for Forrest Gump, Ruby, and Executive Action. You can find Robert in Dealey Plaza along with Marshal Evans educating those who are curious about the case and selling their books, magazine, and DVD.<\/p>"
   },
   {
      "name":"Brent Holland",
      "link":"brent-holland",
      "primary":false,
      "thumbnail":"/assets/images/speakers/secondary/brent-holland.jpg",
	   "bio":"<p>Brent Holland is the radio host of two syndicated shows through the NCRA broadcast system. The Brent Holland Show (interviews with Prime Ministers, Heads of State, Nobel Peace Laureates, Pulitzer, Icons and Night Fright (paranormal / conspiracy number one Canadian based show of its genre). Guests have included: Shirin Ebadi (Nobel Peace Prize), Jody Williams (Nobel Peace Prize), Mairead Maguire (Nobel Peace Prize), Dr. Douglas Osheroff (Nobel Prize for Physics), Ted Sorensen (closest aid to JFK & RFK), Canadian Prime Minister Paul Martin, His Excellency Governor General David Johnson, Lt. General Roméo Dallaire (Peacekeeping hero), Khaled Hosseini (The Kite Runner), Erin Brockovich (international environmental advocate), Joseph Sebarenzi (Speaker of the Rwanda Parliament, genocide survivor), Minni Jean Brown (civil rights legend; Little Rock Nine), David Finkel (Pulitzer Prize winner / embedded in Iraq), Alan Thicke (star of #1 ABC TV series \"Growing Pains\"; spokesperson for Diabetes Care) in addition, many other guests who have been on Larry King, Charlie Rose, Letterman, Discovery, etc.</p><p>Brent Holland is a music composer for feature films and television having composed for NASA, ABC, CBS, NBC, FOX, PBS, CBC, SRC, CTV, TVA, TQS, Global, etc. and also in Vietnam, France, Turkey, Great Britain and Europe. He is currently scoring a Hollywood feature film starring Martin Sheen, Ed Asner, Sam Waterston, Joe Don Baker and Martin Landeau. Mr. Holland has BFA in Music and BFA in Theatre Design (lighting) having worked extensively in this area with Bon Jovi, Michael Jackson, Rod Stewart, Yes, etc. Night Fright is now syndicated through the 80 station NCRA broadcast network and has achieved number one Canadian based show of its genre.</p><p>The Brent Holland Show was started October 2009 and was started purely to inspire university and college age students, who listen weekly from coast to coast to coast, into service in the global village.</p>"
   },
   {
      "name":"Carmie Savastano",
      "link":"carmine-savastano",
      "primary":false,
      "thumbnail":"/assets/images/speakers/secondary/carmine-savastano.jpg",
	   "bio":"<p>Carmine Savastano is an author, researcher, and Editor-in-Chief of the Neapolis Media Group. His writings focus on intelligence, government, and international politics. He has studied legal documents for years, written over sixty research articles based on verifiable evidence, makes regular appearances in the in the independent media, including The Ochelli Effect, and had several research findings accepted by the Mary Ferrell Foundation and Assassination Archives and Research Center.</p>"
   },
   {
      "name":"Chuck Ochelli",
      "link":"chuck-ochelli",
      "primary":false,
      "thumbnail":"/assets/images/speakers/secondary/chuck-ochelli.jpg",
	   "bio":"<p>Chuck Ochelli is an independent media talk radio show host also known as \"The Blind JFK Researcher\". His study of the JFK assassination spans nearly three decades and is consistently featured on his show \"The Ochelli Effect\", striving to educate the public in which he views are the historical realities of November 22, 1963, which continue to influence the world today.</p>"
   },
   {
      "name":"Debra Conway",
      "link":"debra-conway",
      "primary":false,
      "thumbnail":"/assets/images/speakers/secondary/debra-conway.jpg",
	   "bio":"<p>Debra Conway will speak on behalf of JFK Lancer, a historical research company specializing in the administration and assassination of President John F. Kennedy; founded in 1995 by Thomas A. Jones and Debra J. Conway. JFK Lancer works with the largest and most active group of President John F. Kennedy historical researchers. Our past conferences have hosted many of the eye witnesses of the assassination and the most respected of authors and researchers from around the world. JFK Lancer subscribes to the values of patriotism, excellence, integrity, and dedication to the revealing of truth surrounding the assassination of President John F. Kennedy. Our goal is to make research materials concerning Kennedy's assassination easily available to everyone. Our prime concern is the accuracy of history and the true story of the turbulent 1960s.</p>"
   },
   {
      "name":"Doug Campbell",
      "link":"doug-campbell",
      "primary":false,
      "thumbnail":"/assets/images/speakers/secondary/doug-campbell.jpg",
	   "bio":"<p>Doug Campbell has been researching and studying the JFK Assassination for 38 years and is the researcher, writer & host of \"The Dallas Action, Presented By Wall Street Window\", a podcast dedicated to forward-moving research of the Kennedy Assassination (<a href='https://www.spreaker.com/show/the-dallas-actions-tracks'>https://www.spreaker.com/show/the-dallas-actions-tracks</a>). He is also a Researcher, Writer & Co-Host of \"Quick Hits: A JFK Assassination Research News & Notes Podcast, With Rob Clark & Doug Campbell\" (<a href='https://www.spreaker.com/show/quick-hits-podcast'>https://www.spreaker.com/show/quick-hits-podcast</a>). Campbell was also a contributing author to the book \"Pieces Of The Puzzle: An Anthology\", by Gayle Nix Jackson, which can be purchased at <a href='https://www.amazon.com/Pieces-Puzzle-Anthology-JFK-Book-ebook/dp/B077LJV2G9/ref=sr_1_1?dchild=1&keywords=gayle+nix+jackson+book&qid=1602698969&sr=8-1'>Amazon</a>.</p>"
   },
   {
      "name":"Greg Wagner",
      "link":"greg-wagner",
      "primary":false,
      "thumbnail":"/assets/images/speakers/secondary/greg-wagner.jpg",
	   "bio":"<p>Greg Wagner resides in Gahanna, Ohio and has studied the assassination of President Kennedy since the 1980’s. He is a finance professional with a bachelor’s degree in Economics from Ohio State University and a master’s degree in business administration from Ohio Dominican University.</p>"
   },
   {
      "name":"James Corbett",
      "link":"james-corbett",
      "primary":false,
      "thumbnail":"/assets/images/speakers/secondary/james-corbett.jpg",
	   "bio":"<p>James Corbett started The Corbett Report website in 2007 as an outlet for independent critical analysis of politics, society, history, and economics. He has lectured on geopolitics at the University of Groningen’s Studium Generale, and delivered presentations on open source journalism at The French Institute for Research in Computer Science and Automation’s fOSSa conference, at TedXGroningen and at Ritsumeikan University in Kyoto.</p>"
   },
   {
      "name":"Jim Jenkins",
      "link":"jim-jenkins",
      "primary":false,
      "thumbnail":"/assets/images/speakers/secondary/jim-jenkins.jpg",
 	   "bio":"<p>Jim Jenkins had joined the Navy as an aviation cadet in 1961; due to color blindness he had to forego his dream of flying fighter jets. He then set his focus on medicine and began serving as a corpsman in the Navy. At the time of John F. Kennedy’s assassination, Jenkins was a student at Bethesda Naval Medical School and assigned to the pathology department. On the day of the assassination, he was asked to assist in the autopsy of President Kennedy. Jenkins was interviewed for William Law’s book \"In the Eye of History: Disclosures in the JFK Assassination Medical Evidence\" and later went on to co-author \"On the Cold Shoulder of History.\"</p>"
   },
   {
      "name":"John Newman",
      "link":"john-newman",
      "primary":false,
      "thumbnail":"/assets/images/speakers/secondary/john-newman.jpg",
	   "bio":"<p>Dr. John Newman is a retired U.S. Army Intelligence officer who served for two years as a Military Assassinat to the Director, General William Odom, at the National Security Agency, and has experience and expertise as a strategic intelligence cryptologic analyst. His 1991 ground-breaking book, \"JFK and Vietnam\" (updated in 2017), led to his writing the 1995 book \"Oswald and the CIA\". Dr. Newman re-entered the JFK case in 2015 with the publication of \"Where Angels Tread Lightly: The Assassination of President Kennedy, Vol. I.\" \"Countdown to Darkness: The Assassination of President Kennedy Vol. II\" came in 2017. \"Into the Storm: The Assassination of President Kennedy Vol. III\" came in 2019. He is currently working on the book \"Armageddon: The Assassination of President Kennedy Vol. IV\". Dr. Newman is Adjunct Professor of Political Science at James Madison University. For the past quarter century, his work has overturned orthodoxies, broken new ground, introduced new facts, and produced revelations about America during the Cold War.</p>"
   },
   {
      "name":"Johnny Cairns",
      "link":"johnny-cairns",
      "primary":false,
      "thumbnail":"/assets/images/speakers/secondary/johnny-cairns.jpg",
	   "bio":"<p>Johnny Cairns was born and lives in Edinburgh, Scotland. He first became interested in the assassination of President John F. Kennedy from his father, Robert Cairns, who shared his admiration for the U.S. President with him from a very early age. This admiration persisted through the years, from school projects to being a writer for Dave O’Brien’s book \"Case Not Closed\" (2020), to being a conference speaker for JFK Lancer. Cairns lays out the arguments and evidence cited against the accused and points out it's seriously flawed foundation. He considers the Oswald story one of tragedy; one that started with wrongful condemnation of an innocent man, which culminated in his death at a young age of 24 and branded as a murderer for over half a century for a crime, Johnny argues, he did not commit.</p>"
   },
   {
      "name":"Larry Hancock",
      "link":"larry-hancock",
      "primary":false,
      "thumbnail":"/assets/images/speakers/secondary/larry-hancock.jpg",
	   "bio":"<p>Larry Hancock brings his formal training history and cultural anthropology to his research and writing on Cold War history and national security subject. Following service in the U.S. Air Force, his career in computer/comm and tech marketing led to consulting on strategic analysis and planning studies. Lovingly known as a \"document geek\", he has researched and published several collections of CIA, FBI and military documents prior to beginning his writing efforts. His document work led to his becoming a board member of the Mary Ferrell Foundation. With seven books in print, his most recent works include an exploration of long term patterns in covert action and deniable warfare \"Shadow Warfare\" (2014), the effectiveness of national command authority and command and control practice \"Surprise Attack\" (2015) and the national intelligence problem of UFOs \"Unidentified\" (2018). He has received the prestigious Marry Ferrell New Frontier Award for the contribution of new evidence in the Kennedy assassination case, and the Mary Ferrell Legacy Award. Visit Larry’s website <a href='http://larry-hancock.com/'>http://larry-hancock.com/</a>.</p>"
   },
   {
      "name":"Mark Shaw",
      "link":"mark-shaw",
      "primary":false,
      "thumbnail":"/assets/images/speakers/secondary/mark-shaw.jpg",
	   "bio":"<p>For more than fifty years, the exhaustive 18-month investigation of the JFK assassination by What's My Line? television star and revered investigative reporter Dorothy Kilgallen has been buried due to a cover-up by those threatened with a tell-all book she was writing for Random House. When the famed journalist, called by the New York Post, \"the most powerful voice in America,\" was found dead in her Manhattan apartment in November 1965 of an alleged drug overdose, no investigation occurred despite a staged death scene and suspicions by those closest to her that she had been murdered.</p><p>Now the full thrust of Kilgallen's search for the truth is exposed for the first time in former USA Today and CNN legal analyst Mark Shaw's 25th book, \"The Reporter Who Knew Too Much\" (Post Hill Press/Simon and Schuster). Relying on Kilgallen's toxic columns blasting the \"Oswald Alone\" theory, her flawed autopsy report and never-before-seen videotaped interviews with Kilgallen's two hairdressers, one who found her body, and Jack Ruby co-counsel Joe Tonahill, who befriended Kilgallen when she covered the Ruby trial while permitting her the only interviews Ruby gave to a reporter, Shaw solves the mystery of Kilgallen's shocking death by presenting the most compelling evidence about the JFK assassinations since the HSCA investigation in the 1970s. Kilgallen may have been denied justice when she died, but through this breakthrough book, her legacy lives on. More about the author may be learned at <a href='thereporterwhoknewtoomuch.com'>thereporterwhoknewtoomuch.com</a>.</p>"
   },
   {
      "name":"Pete Mellor",
      "link":"pete-mellor",
      "primary":false,
      "thumbnail":"/assets/images/speakers/secondary/pete-mellor.jpg",
	   "bio":"<p>Mellor is a Merchant Navy Ship's Officer and a college lecturer in Marine Electronics. He had attended the JFK Lancer conference in 2003 and 2013. Mellor is a member of Dealey Plaza U.K. and is a co-researcher on Osborne with John Kowalski.</p>"
   },
   {
      "name":"Scott Reid",
      "link":"scott-reid",
      "primary":false,
      "thumbnail":"/assets/images/speakers/secondary/scott-reid.jpg",
	   "bio":"<p>Scott Reid, a lifelong resident of Glasgow, Scotland, has had a keen interest turned obsession in the JFK assassination. It all began in the early 1980’s when as a teenager, he watched a TV program about the assassination with his brother.</p><p>He eventually made his first visit to Dealey Plaza in June 1996, returning to Dallas for the 50th anniversary of the assassination in 2013, gate crashing the COPA Conference, where he met his first witnesses, respected writers, and good friends.</p><p>Since 2013, Scott has returned to Dallas every year from the UK, as well as New Orleans in 2016 and 2018, to attend conferences and visit sites of JFK-related interest. His articles have been published in the Dealey Plaza UK magazine. Scott once said though that he did not regard himself as a JFK researcher, just a person with a day job but a keen interest in the case. That changed when he became intrigued by the story of fellow Scot, William Duff, who at first sight seems like a fringe character on the periphery of the JFK story, but with a story all of his own. Scott felt this story deserved more investigation and scrutiny. Scott can now honestly say that he has now joined the ranks of the researchers. He continues to develop the story of William Duff in his spare time.</p>"
   },
   {
      "name":"Stu Wexler",
      "link":"stu-wexler",
      "primary":false,
      "thumbnail":"/assets/images/speakers/secondary/stu-wexler.jpg",
	   "bio":"<p>Stu Wexler is a teacher of World History, AP Government at Hightstown High School, Hightstown, NJ. His JFK assassination research has focused on the issues connected to the chemical analysis of the ballistics material, in which he has collaborated with chemist Tom Pinkston. Wexler is a regular speaker at JFK Lancer's NID Conference, as well as at the Wecht conference, and the AARC conference; several of those times were opposite Dr. Kenneth Rahn, NAA advocate, from the University of Rhode Island. Wexler's other Kennedy interests focus on Oswald's background and associates leading up to November 22nd. He co-authored the book, \"The Awful Grace of God,\" with Larry Hancock, on the MLK assassination. He was awarded the JFK Lancer Mary Ferrell \"New Frontier\" Award, 2011.</p>"
   },
   {
      "name":"David Boylan",
      "link":"david-boylan",
      "primary":false,
      "thumbnail":"/assets/images/speakers/secondary/david-boylan.jpg",
	   "bio":"<p>Boylan is the author of A League of Their Own: Inside the Christian Defense League and Co-author with Larry Hancock of The Wheaton Lead - An Exploration.</p>"
   },
   {
      "name":"Pamela Brown",
      "link":"pamela-brown",
      "primary":false,
      "thumbnail":"",
	   "bio":""
   },
   {
      "name":"Russ Baker",
      "link":"russ-baker",
      "primary":false,
      "thumbnail":"",
	   "bio":""
   },
   {
      "name":"Dr. Larry Haapanen",
      "link":"dr-larry-haapanen",
      "primary":false,
      "thumbnail":"",
	   "bio":""
   },
   {
      "name":"Rex Bradford",
      "link":"rex-bradford",
      "primary":false,
      "thumbnail":"/assets/images/speakers/secondary/rex-bradford.jpg",
	   "bio":"<p>Rex Bradford is a computer game developer who has become an electronic archivist of the assassination of John F. Kennedy. He began scanning documents and making them available online and on CDs in 1999. He is the president and analyst/archivist for the Mary Ferrell Foundation, Vice-President of the Assassination Archives and Research Center, and founded History Matters. He has written several essays and given talks on the \"Oswald Mexico City trip\" and the medical evidence at the JFK Lancer November in Dallas Conference in the past.</p>"
   },
   {
      "name":"Alan Dale",
      "link":"alan-dale",
      "primary":false,
      "thumbnail":"/assets/images/speakers/secondary/alan-dale.jpg",
	   "bio":"<p>Alan Dale is a host of JFK Lancer: Conversations, an online interview program featuring in-depth discussions with prominent authors, historical researchers, and notable personalities associated with the study of President Kennedy’s assassination. He is a full-time professional jazz musician and band leader, a lifetime student of American history whose parents were active as supporters and volunteers in the political campaigns of John and Robert Kennedy. He is the administrator of <a href=\"jfkessentials.com\">jfkesssentials.com</a>.</p>"
   },
   {
      "name":"Brian Edwards",
      "link":"brian-edwards",
      "primary":false,
      "thumbnail":"",
	   "bio":""
   },
   {
      "name":"Steve Griggs",
      "link":"steve-griggs",
      "primary":false,
      "thumbnail":"",
	   "bio":""
   },
   {
      "name":"David Knight",
      "link":"david-knight",
      "primary":false,
      "thumbnail":"",
	   "bio":""
   },
   {
      "name":"William Law",
      "link":"William-law",
      "primary":false,
      "thumbnail":"/assets/images/speakers/secondary/william-law.jpg",
      "bio":"<p>William Law, a frequent contributor to JFK Lancer, is the author of the book, \"In the Eye of History,\"  and co-authored \"Betrayal: A JFK Honor Guard Speaks\" and \"On the Cold Shoulder of History\". Law's interest in the Kennedy assassination began in 1975 with the showing of Abraham Zapruder's 26-second home movie of the event on Geraldo Rivera's \"Goodnight America\" program. Later, after reading David Lifton's book \"Best Evidence\", Law began researching Kennedy's murder. Law has written for the research periodicals the \"Kennedy Assassination Chronicles\" and the \"Dealey Plaza Echo\", is producer of the DVD \"The Gathering\", and served as a consultant to film director Brian McKenna for his documentary \"Killing Kennedy\" and one with Mark Sobel to co-produce a documentary on the assassination of Robert Kennedy.</p>"
   },
   {
      "name":"Jefferson Morley",
      "link":"jefferson-morley",
      "primary":false,
      "thumbnail":"/assets/images/speakers/secondary/jefferson-morley.jpg",
      "bio":"<p>Jefferson Morley is a journalist and editor who has worked in Washington journalism for over thirty years, fifteen of which were spent as an editor and reporter at The Washington Post. The author of The Ghost, a biography of CIA spymaster James Jesus Angleton, and Our Man in Mexico, a biography of the CIA’s Mexico City station chief Winston Scott, Morley has written about intelligence, military, and political subjects for Salon, The Atlantic, and The Intercept, among others. He is the editor of JFK Facts, a blog.</p>"
   },
   {
      "name":"Casey Quinlan",
      "link":"casey-quinlan",
      "primary":false,
      "thumbnail":"",
      "bio":""
   },
   {
      "name":"Steve Roe",
      "link":"steve-roe",
      "primary":false,
      "thumbnail":"/assets/images/speakers/secondary/steve-roe.jpg",
      "bio":"<p>Roe is recently retired living in the Texas Hill Country area near San Antonio. His work experience includes 36 years in the Oil/Gas Exploration industry and 4 years in the Medical Biotech field. Roe has a Bachelor of Science degree in Geology from Stephen F. Austin University, Nacogdoches, Texas. He was born in Detroit, Michigan 1955, lived in Dallas, Texas from 1956 to 1975. Roe resided in Texas from 1956 to 1983, and in Southern California from 1983 to 2019. He has worked in numerous places including Venezuela, Colombia, Ecuador, Mexico, Belize, Papua New Guinea and domestic in Texas, California, Oregon, Nevada, New Mexico, Louisiana and Hawaii.</p><p>His hobbies include Golf, Hunting, Fishing, Texas history, Dallas history, 1960's Vintage Rock Posters and the JFK Assassination. Roe was a contributing author for Gayle Nix Jackson's 2017 book \"Pieces of the Puzzle\" (Welcome Mr. Kennedy to Dallas chapter) and authored \"Earle Cabell – Bombshell or Dud?\" 2018 article for \"Washington Decoded\" (Max Holland). Roe has an oral history at the Sixth Floor Museum with Stephen Fagin. He is an Independent researcher interested in trying to find answers to various questions, people, and events associated with the JFK assassination, primarily topics surrounding General Walker, Oswald and Dallas.</p>"
   },
   {
      "name":"Mike Swanson",
      "link":"mike-swanson",
      "primary":false,
      "thumbnail":"/assets/images/speakers/secondary/mike-swanson.jpg",
      "bio":"<p>Michael Swanson is the founder and head editor of <a href=\"WallStreetWindow.com\">WallStreetWindow.com</a>. He ran a hedge fund from 2003 to 2006 that generated a return of over 78% for its investors during that time frame and in one year was ranked in the top thirty-five hedge funds among several thousand tracked by hedgefund.net. He received a Masters Degree in history from the University of Virginia in 1998 and since retiring from the hedge fund world writes about global investment trends, the financial markets, and American history.</p><p>Swanson has also authored \"The War State: The Cold War Origins Of The Military-Industrial Complex And The Power Elite, 1945-1963\" and is a frequent guest on The Ochelli Effect (<a href=\"ochelli.com\")>ochelli.com</a>).</p>"
   }
]